Revit 2024 API
ParameterTypeId.RoomPhase Property
 "Phase"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoomPhase { get; }
Visual Basic
Public Shared ReadOnly Property RoomPhase As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoomPhase {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace